garyPenhook/PyAvrOCD/svd/avr64da48s.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>PORTC</name>
      <description>I/O Ports</description>
      <baseAddress>0x00800440</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0xF</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x10</offset>
        <size>0x8</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>DIR</name>
          <description>Data Direction</description>
          <addressOffset>0x0</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>DIRCLR</name>
          <description>Data Direction Clear</description>
          <addressOffset>0x2</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>DIRSET</name>
          <description>Data Direction Set</description>
          <addressOffset>0x1</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>DIRTGL</name>
          <description>Data Direction Toggle</description>
          <addressOffset>0x3</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>IN</name>
          <description>Input Value</description>
          <addressOffset>0x8</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>INTFLAGS</name>
          <description>Interrupt Flags</description>
          <addressOffset>0x9</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>INT</name>
              <description>Pin Interrupt Flag</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>OUT</name>
          <description>Output Value</description>
          <addressOffset>0x4</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>OUTCLR</name>
          <description>Output Value Clear</description>
          <addressOffset>0x6</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>OUTSET</name>
          <description>Output Value Set</description>
          <addressOffset>0x5</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>OUTTGL</name>
          <description>Output Value Toggle</description>
          <addressOffset>0x7</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>PIN0CTRL</name>
          <description>Pin 0 Control</description>
          <addressOffset>0x10</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ISC</name>
              <description>Input/Sense Configuration</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INTDISABLE</name>
                  <description>Interrupt disabled but input buffer enabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BOTHEDGES</name>
                  <description>Sense Both Edges</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RISING</name>
                  <description>Sense Rising Edge</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FALLING</name>
                  <description>Sense Falling Edge</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INPUT_DISABLE</name>
                  <description>Digital Input Buffer disabled</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LEVEL</name>
                  <description>Sense low Level</description>
                  <value>5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PULLUPEN</name>
              <description>Pullup enable</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>INVEN</name>
              <description>Inverted I/O Enable</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PIN1CTRL</name>
          <description>Pin 1 Control</description>
          <addressOffset>0x11</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ISC</name>
              <description>Input/Sense Configuration</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INTDISABLE</name>
                  <description>Interrupt disabled but input buffer enabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BOTHEDGES</name>
                  <description>Sense Both Edges</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RISING</name>
                  <description>Sense Rising Edge</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FALLING</name>
                  <description>Sense Falling Edge</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INPUT_DISABLE</name>
                  <description>Digital Input Buffer disabled</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LEVEL</name>
                  <description>Sense low Level</description>
                  <value>5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PULLUPEN</name>
              <description>Pullup enable</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>INVEN</name>
              <description>Inverted I/O Enable</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PIN2CTRL</name>
          <description>Pin 2 Control</description>
          <addressOffset>0x12</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ISC</name>
              <description>Input/Sense Configuration</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INTDISABLE</name>
                  <description>Interrupt disabled but input buffer enabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BOTHEDGES</name>
                  <description>Sense Both Edges</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RISING</name>
                  <description>Sense Rising Edge</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FALLING</name>
                  <description>Sense Falling Edge</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INPUT_DISABLE</name>
                  <description>Digital Input Buffer disabled</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LEVEL</name>
                  <description>Sense low Level</description>
                  <value>5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PULLUPEN</name>
              <description>Pullup enable</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>INVEN</name>
              <description>Inverted I/O Enable</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PIN3CTRL</name>
          <description>Pin 3 Control</description>
          <addressOffset>0x13</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ISC</name>
              <description>Input/Sense Configuration</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INTDISABLE</name>
                  <description>Interrupt disabled but input buffer enabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BOTHEDGES</name>
                  <description>Sense Both Edges</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RISING</name>
                  <description>Sense Rising Edge</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FALLING</name>
                  <description>Sense Falling Edge</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INPUT_DISABLE</name>
                  <description>Digital Input Buffer disabled</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LEVEL</name>
                  <description>Sense low Level</description>
                  <value>5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PULLUPEN</name>
              <description>Pullup enable</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>INVEN</name>
              <description>Inverted I/O Enable</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PIN4CTRL</name>
          <description>Pin 4 Control</description>
          <addressOffset>0x14</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ISC</name>
              <description>Input/Sense Configuration</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INTDISABLE</name>
                  <description>Interrupt disabled but input buffer enabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BOTHEDGES</name>
                  <description>Sense Both Edges</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RISING</name>
                  <description>Sense Rising Edge</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FALLING</name>
                  <description>Sense Falling Edge</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INPUT_DISABLE</name>
                  <description>Digital Input Buffer disabled</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LEVEL</name>
                  <description>Sense low Level</description>
                  <value>5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PULLUPEN</name>
              <description>Pullup enable</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>INVEN</name>
              <description>Inverted I/O Enable</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PIN5CTRL</name>
          <description>Pin 5 Control</description>
          <addressOffset>0x15</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ISC</name>
              <description>Input/Sense Configuration</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INTDISABLE</name>
                  <description>Interrupt disabled but input buffer enabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BOTHEDGES</name>
                  <description>Sense Both Edges</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RISING</name>
                  <description>Sense Rising Edge</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FALLING</name>
                  <description>Sense Falling Edge</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INPUT_DISABLE</name>
                  <description>Digital Input Buffer disabled</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LEVEL</name>
                  <description>Sense low Level</description>
                  <value>5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PULLUPEN</name>
              <description>Pullup enable</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>INVEN</name>
              <description>Inverted I/O Enable</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PIN6CTRL</name>
          <description>Pin 6 Control</description>
          <addressOffset>0x16</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ISC</name>
              <description>Input/Sense Configuration</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INTDISABLE</name>
                  <description>Interrupt disabled but input buffer enabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BOTHEDGES</name>
                  <description>Sense Both Edges</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RISING</name>
                  <description>Sense Rising Edge</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FALLING</name>
                  <description>Sense Falling Edge</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INPUT_DISABLE</name>
                  <description>Digital Input Buffer disabled</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LEVEL</name>
                  <description>Sense low Level</description>
                  <value>5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PULLUPEN</name>
              <description>Pullup enable</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>INVEN</name>
              <description>Inverted I/O Enable</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PIN7CTRL</name>
          <description>Pin 7 Control</description>
          <addressOffset>0x17</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ISC</name>
              <description>Input/Sense Configuration</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INTDISABLE</name>
                  <description>Interrupt disabled but input buffer enabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BOTHEDGES</name>
                  <description>Sense Both Edges</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RISING</name>
                  <description>Sense Rising Edge</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FALLING</name>
                  <description>Sense Falling Edge</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INPUT_DISABLE</name>
                  <description>Digital Input Buffer disabled</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LEVEL</name>
                  <description>Sense low Level</description>
                  <value>5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PULLUPEN</name>
              <description>Pullup enable</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>INVEN</name>
              <description>Inverted I/O Enable</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
